const Map<String, String> ru = {

  "welcome":"Добро пожаловать в наше приложение\n",
  "setting":"Меню настроек\n",
  "exit":"Выход\n",
  "start":"Начать",
  "createUsername":"Пожалуйста, придумайте имя пользователя: ",
  "createPassword":"Пожалуйста, придумайте пароль: ",
  "askUsername":"Пожалуйста, введите ваш логин: ",
  "askPhoneNumber":"Пожалуйста, введите свой номер телефона\nПримечание: Оно должно состоять из 9 цифр.\n",
  "askPassword":"Пожалуйста введите ваш пароль:\n",
  "successfull":"Успешно зарегистрирован!\n",
  "fromLang" : "С какого языка вы хотите перевести?\n",
  "toLang" : "На какой язык вы хотите перевести?\n",
  "word" : "Введите слово:\n",
  "translation:": "Введите перевод:\n",
 "description" : "Введите описание слова\n",
  "adminUserName": "Пожалуйста, введите имя пользователя администратора:\n",
  "adminPassword": "Пожалуйста, введите пароль администратора:\n",
  "succesfullyEnteredA" : "Администратор успешно вошел в систему\n",
  "tryAgain": "Введите неправильно, попробуйте еще раз\n",
  "choose" : "Выбирать\n",
  "notRegistered": "Вы не зарегистрированы!\n",
  "loginSuccessfully": "Авторизация успешна!\n",
  "userName": "Пожалуйста, введите Ваш логин:\n",
  "userPassword":"Пожалуйста, введите пароль\n",
   "addedWords": "Добавленные слова пользователем\n",
   "searchedWords": "Слова, найденные пользователем\n",
   "checkWAI": "Проверьте с ИИ\n",
   "logOut":"Вы действительно хотите выйти?\n",
   "ChangeLan" : "Изменить язык",
  "SignIn" : "Войти",
  "SignUp" : "Зарегистрироваться",
  "AddNewWord" : "Добавить новое слово",
  "history" : "История",
  "dictionary" : "Словарь",
  "settings" : "Настройки",
  "mainMenu" : "Главное меню",
  "goBack" : "Возвращаться",
  "historyMenu" : "Меню истории\n",
  "settingsMenu" : "Меню настроек\n",
  "deleteAccount" : "Удалить аккаунт\n",
  "LogOut" : "Выйти\n",
  "TranslateApp" : "Приложение переводчик\n",
  "usersInfo" : "Просмотр информации о пользователе",
  "deleteWrongWords" : "Удалите ненужные слова",
  "chooseFT" : "Выбирайте оттудаn\n",
  "deleteUser" : "Удалить пользователя\n",
  "enterUser" : "Введите серийный номер пользователя, которого вы хотите удалить\n",
  "enterOnlyNum" : "Пожалуйста, введите только число\n",
  "successDeleteUser" : "Пользователь успешно удален!\n",
  "fromWhere" : "Где именно вы хотите удалить слова?\n",
  "fromSearchedWords" : "Из переведенных слов\n",
  "fromAddedWords" : "Из слов, добавленных в словарь\n",
  "deleteWords" : "Удалить слова\n",
  "enterWordsSD" : "Введите порядковый номер слова, которое вы хотите удалить.\n",
  "successDeleteWords" : "Слово успешно удалено!\n",
  "adminMenu" : "Admin Menu\n",
  "successDelete": "Успешно удалено\n",
  "enterPassword" : "Введите ваш пароль\n",
  "acceptedPassword" : "Пароль принят\n",
  "passwordNotContainSpace" : "Пароль не может содержать пробелов\n",
  "notAcceptedPassword" : "Пароль не принят\n",
  "passwordCUcLc8ch" : "Пароль должен содержать заглавную букву, цифру, строчную букву и всего 8 символов.\n",
  "username3ch16chNot" : "Имя пользователя не может быть менее 3 и более 16 символов.\n",
  "usernameNotContainSpace": "Имя пользователя не может содержать пробелов\n",
  "alreadyHave":"Такое имя пользователя уже существует\n",
 "acceptedUsername":"Имя пользователя принято\n",
 "acceptedPN":"Номер телефона принят\n",
 "only9digit":"Просто введите 9 цифр!\n",
 "globTranslate":"Глобальный перевод\n",
 "dictionaryMenu":"Меню словаря\n",
  "user":"Пользователь",
  "admin":"Aдминистратор",
 "firsCharUser":"Первым символом имени пользователя не может быть цифра!",
 "yes":"Да",
 "no":"Нет",
 "errorchosedfromlan":"Переводимый язык был выбран не правильно! Введите еще раз!",
 "errorchosedtolan":"Переводимый язык был выбран не правильно! Введите еще раз!",
 "awailableLangs":"Вот доступные языки, на которых вы можете использовать их ключи.",


























};